# a代表变量名，=赋值符，表示把左边的值存到左边的变量
# 字符串有四种表示方法，"第一种表示方式"  '第二种表示方法'  '''第三种'''  """第四种"""
a = "dahjkhdj"
print(a,type(a))
b = 21
print(b,type(b))

# ()表示tuple代表一个元组，可以存多个数据，多个数据中间用","隔开
c = (1,3,5,7)
print(c,type(c))

# []表示list代表一个列表，可以存多个数据，多个数据中间用","隔开
d = [1,3,4,6]
print(d,type(d))

# {}表示dict代表一个字典，可以存储多个键值对格式数据，多个键值对中间用","隔开，键值对内容key和value用":"隔开
e = {"姓名":"master易","手机号":"18983410648","性别":"男"}
print(e,type(e))

aa = ("张三","李四","王五","赵六","钱七")
print(aa)
bb = {"姓名":"张三","年龄":18,"性别":"女","科目":"语文","成绩":80}
print(ee)
print(bb)
cc = ["A",2,3,4,5,6,7,8,9,"J","Q","K"]
print(cc)
dd = 10000
print(dd)
ee = "学生"
print(aa,bb,cc,dd,ee)